Core/src/Documents/ОстаткиЕГАИС/ОстаткиЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОстаткиЕГАИС</name>
  <registerRecords>AccountingRegister.AzRyХозрасчетныйUSD</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиАлкогольнойПродукцииЕГАИС</registerRecords>
  <attributes>
    <name>ОрганизацияЕГАИС</name>
    <type>
      <types>CatalogRef.КлассификаторОрганизацийЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбработки</name>
    <type>
      <types>EnumRef.СтатусыОбработкиОстатковЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДокумента</name>
    <type>
      <types>EnumRef.ВидыДокументовЕГАИС</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Магазин</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОстаткиПоДаннымЕГАИС</name>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <type>
        <types>CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СправкаБ</name>
      <type>
        <types>CatalogRef.СправкиБЕГАИС</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КорректировкаОстатков</name>
    <attributes>
      <name>АлкогольнаяПродукция</name>
      <type>
        <types>CatalogRef.КлассификаторАлкогольнойПродукцииЕГАИС</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СправкаБ</name>
      <type>
        <types>CatalogRef.СправкиБЕГАИС</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/Enums/ВидыДокументовЕГАИС/ВидыДокументовЕГАИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДокументовЕГАИС</name>
  <enumValues>
    <name>АктОтказаОтТТН</name>
  </enumValues>
  <enumValues>
    <name>АктПодтвержденияТТН</name>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБаланс</name>
  </enumValues>
  <enumValues>
    <name>АктПостановкиНаБалансВТорговомЗале</name>
  </enumValues>
  <enumValues>
    <name>АктРасхожденийТТН</name>
  </enumValues>
  <enumValues>
    <name>АктСписания</name>
  </enumValues>
  <enumValues>
    <name>АктСписанияИзТорговогоЗала</name>
  </enumValues>
  <enumValues>
    <name>ВозвратИзТорговогоЗала</name>
  </enumValues>
  <enumValues>
    <name>ЗапросАлкогольнойПродукции</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаПостановкиНаБаланс</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияАктаСписания</name>
  </enumValues>
  <enumValues>
    <name>ЗапросНаОтменуПроведенияТТН</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОрганизаций</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатков</name>
  </enumValues>
  <enumValues>
    <name>ЗапросОстатковВТорговомЗале</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправкиА</name>
  </enumValues>
  <enumValues>
    <name>ЗапросСправкиБ</name>
  </enumValues>
  <enumValues>
    <name>ЗапросТТН</name>
  </enumValues>
  <enumValues>
    <name>ИнформацияОФорматеОбмена</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияПроведения</name>
  </enumValues>
  <enumValues>
    <name>КвитанцияФиксации</name>
  </enumValues>
  <enumValues>
    <name>ОтветАлкогольнаяПродукция</name>
  </enumValues>
  <enumValues>
    <name>ОтветОрганизации</name>
  </enumValues>
  <enumValues>
    <name>ОтветОстатки</name>
  </enumValues>
  <enumValues>
    <name>ОтветОстаткиВТорговомЗале</name>
  </enumValues>
  <enumValues>
    <name>ОтказОтАктаРасхожденийТТН</name>
  </enumValues>
  <enumValues>
    <name>ПередачаВТорговыйЗал</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеАктаРасхожденийТТН</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияСправокПоТТН</name>
  </enumValues>
  <enumValues>
    <name>СправкаА</name>
  </enumValues>
  <enumValues>
    <name>СправкаБ</name>
  </enumValues>
  <enumValues>
    <name>ТТН</name>
  </enumValues>
  <enumValues>
    <name>ЧекККМ</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ОстаткиЕГАИС/Forms/ФормаСпискаУНФ/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Документы.ОстаткиЕГАИС.УстановитьУсловноеОформлениеСтатусаОбработки(ЭтотОбъект);
	//Паганини_
	ФункционалЗапретаРедактированияДокументов = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеКонстанты("ФункционалЗапретаРедактированияДокументов");
	//_Паганини
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьСписокЗапросовЕГАИС" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыгрузитьВЕГАИС(Команда)
	
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВидДокумента = ПредопределенноеЗначение("Перечисление.ВидыДокументовЕГАИС.ЗапросОстатков");
	
	ПараметрыЗапроса = ИнтеграцияЕГАИСКлиентСервер.ПараметрыИсходящегоЗапроса(ВидДокумента);
	ПараметрыЗапроса.ДокументСсылка = Элементы.Список.ТекущиеДанные.Ссылка;
	
	ИнтеграцияЕГАИСКлиент.НачатьФормированиеИсходящегоЗапроса(
		Новый ОписаниеОповещения("ВыгрузкаВЕГАИС_Завершение", ЭтотОбъект),
		ВидДокумента,
		ПараметрыЗапроса);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ВыгрузкаВЕГАИС_Завершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Результат Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ka='Запрос на загрузку остатков сформирован.';ru='Запрос на загрузку остатков сформирован.';en='Download Request residues formed.'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
